In [1]:
import pandas as pd

print(pd.__version__)

2.3.3

In [7]:
#Cargar un archivo CSV
df = pd.read_csv("Libro1.csv", sep=";")

# Mostrar las primeras filas del DataFrame
print(df.head())

   Nombre  Edad     Ciudad  Unnamed: 3
0    Juan    26     Ibague         NaN
1   Pedro    56  Monterrey         NaN
2  Camilo    15     Bogota         NaN

In [8]:
# Ver las primeras filas del DataFrame
df.head()

   Nombre  Edad     Ciudad  Unnamed: 3
0    Juan    26     Ibague         NaN
1   Pedro    56  Monterrey         NaN
2  Camilo    15     Bogota         NaN

In [9]:
# Filtrar filas donde la edad es mayor a 25
mayores = df[df['Edad'] > 25]
print(mayores)

  Nombre  Edad     Ciudad  Unnamed: 3
0   Juan    26     Ibague         NaN
1  Pedro    56  Monterrey         NaN

In [10]:
#Calculemos la edad promedio
promedio = df['Edad'].mean()
print(f"La edad promedio es: {promedio}")

La edad promedio es: 32.333333333333336

In [ ]:
# Elimina una columna en especial 
df_limpio = df.drop("Unnamed: 3", axis = 1)
df_limpio

   Nombre  Edad     Ciudad
0    Juan    26     Ibague
1   Pedro    56  Monterrey
2  Camilo    15     Bogota